# КАЛЬКУЛЯТОР ИСПОЛЬЗУЯ СЛОВАРЬ И LAMBDA ФУНКЦИИ:
#     Напишите Калькулятор, который:
# 	1) Запрашивает у пользователя два числа.
# 	2) Запрашивает у пользователя операцию (+, -, *, /).
# 	3) Использует lambda-функции для выполнения соответствующей операции.
# 	4) Выводит результат на экран.
# 	5) Программа должна корректно обрабатывать деление на ноль(используйте try except)
# 	6) Можно использовать if-else для выбора нужной lambda-функции.
# 	7) реализовать программу с помощью словаря, где ключи — операции (+, -, *, /), а значения — соответствующие lambda-функции.

# **ПРИМЕЧАНИЕ: СРОК ВЫПОЛНЕНИЯ БУДЕТ СТОЯТЬ НА ПОНЕДЕЛЬНИК СЛЕДУЮЩЕЙ НЕДЕЛИ, ЗАДАЧА НЕОБЫЧНАЯ И НЕМНОГО ТРУДНАЯ, ПОЭТОМУ БУДЕТ ДАНО БОЛЬШЕ ВРЕМЕНИ**

def calculator(num1, num2, op):

    try:
        num1 = float(num1)
        num2 = float(num2)

        operations = {
            "+": lambda x, y: x + y,
            "-": lambda x, y: x - y,
            "*": lambda x, y: x * y,
            "/": lambda x, y: x / y
        }

        if op not in  operations:
            return "Такого операции нет!"
        return f"\n{operations[op](num1, num2)}"

    except ValueError:
        return "Строковая опреция невозможен!"

    except ZeroDivisionError:
        return "Деление на '0' невозможен!"


inp_num1 = input(" \nВведите первое число: ")
inp_num2 = input("Введите второе число: ")
operator = input("Введите операции: ")

print(calculator(inp_num1, inp_num2, operator))
