# FUNCTIONS:
#     **ПРИМЕЧАНИЕ: Все задачи должны быть решены при помощи функций**

#     1) Вы работаете в Банке и пишите программу которая считает % для кредита. Спросите у пользователя сумму займа(не меньше 100 000)
#     и посчитайте сколько нужно будет вернуть если процент = 7.89, результат округлите до 2 чисел после точки.
#     Формула подсчёта переплаты: Сумма * (% / 100)
def credit(sum_):
    if sum_ < 100000:
        return "Введенная ваша сумма должна быть не меньше 100 000!"
    else:
        return round(sum_ * (7.89 / 100), 2)
user = float(input("Введите сумму займа(не меньше 100 000): "))
print(credit(user))

#     2) Запросите у пользователя ввести текст с цифрами,
#     найти цифры и преобразовать их в целое число, затем вывести на терминал
def numbers(text):
    num = [i for i in text if i.isdigit()]
    if num:
        return ' '.join(num)
    else:
        return "В тексте нет цифр!"
user = input("Введите текст с цифрами: ")
print(numbers(user))

#     3) Создайте  функцию, которая выполняет следующее действие:
#     Пользователь вводит количество месяцев и лет.
#     Вывести в терминал количество дней за это время.
#     Считать, что в каждом месяце 30 дней
def months_and_years(months, years):
    day = (months + 12 * years) * 30
    return f"Кодичество дней {day}"
months = int(input("Введите количество месяцев: "))
years = int(input("Введите количество лет: "))
print(months_and_years(months, years))

#     4) Создайте функцию, которая возвращает словарь,
#     где ключами будут числа от 1 до 10, а значениями эти же числа, возведенные в куб
def dictionary(num):
    dict_ = {i: i ** 3 for i in range(1, num)}
    return dict_
user = int(input("Введите число: "))
print(dictionary(user))

#     5) Напишите функцию, которая высчитывает сумму чисел от 1 до 50 и возвращает результат.
def sum_numbers(num):
    return num * (1 + num) // 2
print(sum_numbers(50))
